dzklwxz/nrf5SDK/examples/keep_david/David_keep_peripheral/main.c
//david add start 
NRF_BALLOC_DEF(m_balloc_AT_pool,40,30);

NRF_QUEUE_DEF( uint8_t *, m_buf_queue, 20, NRF_QUEUE_MODE_NO_OVERFLOW );  //��������

void ble_data_send_with_queue(void);
void create_data(void);
uint16_t sendlength = 0;
uint8_t send_data_pack [200] = {0};
//david add end 

//Peter add start
//�������д洢�����ݽṹ
typedef struct {
    uint8_t * p_data;
    uint16_t length;
} buffer_t;
//NRF_QUEUE_DEF( buffer_t, m_buf_queue, 4, NRF_QUEUE_MODE_NO_OVERFLOW );  //��������
//uint8_t m_data_array[548];  //137*4 = 548  //�������л�����С
uint8_t notify_req;  //���������ӻ�notify���ݴ���
uint8_t notify_enable;  //����ʹ�ܴӻ�notify
uint32_t m_len_sent;  //�������ݳ���
uint32_t m_cnt_5ms;  //�������ݼ�ʱ
//������������λ�ü������
#define DEVICE_ID        (4)  //id = 1-8
#define DATA_HEAD_LEN 5  //һ������ͷ����
uint8_t x = 0;  //0-5
uint8_t y = 0;  //0-3
uint8_t pos_x = 0;  //DATA_HEAD_LEN + (0-5)*21
uint8_t pos_y = 0;  //(0-3)*2137
uint8_t id = 0;  //��¼Ҫ���͵�235�ֽ����ݰ�ID 0-255
void clear_data(void);  //�Ͽ����ʱ�����ջ��������
//Peter add end


//Peter add start
//������㱾��ʱ����
//1ms��ʱ�������ʱʱ��0xFFFF ms
APP_TIMER_DEF( app_timer_rtc_1ms );
uint32_t rtc_1ms = 0;
void app_timer_rtc_1ms_handler( void * p_context )
{
	rtc_1ms++;
	//NRF_LOG_INFO( "%d\r\n", rtc_1ms );
}

//���ʱ��
void app_timer_rtc_1ms_start( void )
{
	uint32_t err_code = 0;
	static uint8_t state = 1;
	
	if( state )
	{
		state = 0;
		
		err_code = app_timer_create( &app_timer_rtc_1ms, APP_TIMER_MODE_REPEATED, app_timer_rtc_1ms_handler);
		APP_ERROR_CHECK( err_code );
	}
	
	err_code = app_timer_start( app_timer_rtc_1ms, APP_TIMER_TICKS( 1 ), NULL );
	APP_ERROR_CHECK( err_code );
}

//ֹͣ��ʱ��
void app_timer_rtc_1ms_stop( void )
{
	uint32_t err_code = 0;
	err_code = app_timer_stop( app_timer_rtc_1ms );
	APP_ERROR_CHECK( err_code );
	rtc_1ms = 0;
}
//Peter add end


//Peter add start
//�����Ϊ�ӻ��������ݵĽ��ģ�5ms����38�ֽ�����
//5ms��ʱ�������ʱʱ��0xFFFF ms
APP_TIMER_DEF( app_timer_rtc_5ms );
uint8_t rtc_5ms;
void app_timer_rtc_5ms_handler(void * p_context)
{
	rtc_5ms++;
	create_data(); // create
}

//���ʱ��
void app_timer_rtc_5ms_start( void )
{
	static uint8_t state = 1;
	uint32_t err_code;
	
	if( state )
	{
		state = 0;
		err_code = app_timer_create( &app_timer_rtc_5ms, APP_TIMER_MODE_REPEATED, app_timer_rtc_5ms_handler );
		APP_ERROR_CHECK(err_code);
	}
	
	err_code = app_timer_start( app_timer_rtc_5ms, APP_TIMER_TICKS( 5 ), NULL );
	APP_ERROR_CHECK( err_code );
}

//ֹͣ��ʱ��
void app_timer_rtc_5ms_stop( void )
{
	uint32_t err_code = 0;
	err_code = app_timer_stop( app_timer_rtc_5ms );
	APP_ERROR_CHECK( err_code );
	rtc_5ms = 0;
}

//Peter add end



//david add start
APP_TIMER_DEF(start_upload_count);
uint32_t start_count = 0;
void start_upload_count_handler( void * p_context )
{
	start_count++;
	if(start_count==5000)
	{
		  start_count=0;
			uint32_t err_code = 0;
		
			err_code = app_timer_stop( start_upload_count );
			APP_ERROR_CHECK( err_code );
		
			notify_enable = 1;  //����ʹ�ܴӻ�notify����
		  app_timer_rtc_1ms_start();  //1ms rtc��ʱ������
		  app_timer_rtc_5ms_start();   //��������͸��
	}

}

//david add end

//Peter add start
//�½�log��ӡģ��
//ͨ����ӡlog��fifo���ٴ�ӡfifo log�����ڣ������Դ�log��ӡ����
#include "app_fifo.h"
app_fifo_t user_fifo;
uint8_t fifo_buff[2048] = { 0 };
void user_fifo_init(void)
{
	uint32_t err_code;
	err_code =  app_fifo_init( &user_fifo, fifo_buff, sizeof(fifo_buff) );
	APP_ERROR_CHECK(err_code);
}

void user_fifo_task( void )
{
	uint32_t len = 1;
	uint8_t data[1] = {0};
	uint32_t err_code = app_fifo_read( &user_fifo, data, &len );
	if( err_code == NRF_SUCCESS )
	{
		app_uart_put( data[0] );
	}
}

void log_printf( uint8_t *data, uint32_t len )
{
	app_fifo_write( &user_fifo, data, &len );
}

//Peter add end


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
																					
	
}

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
		//NRF_LOG_INFO( p_evt->params.rx_data.p_data, p_evt->params.rx_data.length );
		if( p_evt->params.rx_data.p_data[0] == 'A' && p_evt->params.rx_data.p_data[1] == 'C' && p_evt->params.rx_data.p_data[2] == 'K' && p_evt->params.rx_data.p_data[3] == '\r' && p_evt->params.rx_data.p_data[4] == '\n')
		{
			//notify_req++;  //���������ӻ������ݴ���
			//NRF_LOG_INFO("notify_req = %d\r\n", notify_req );
		}
    }
	else if (p_evt->type == BLE_NUS_EVT_COMM_STARTED)
	{
		/*
		notify_enable = 1;  //����ʹ�ܴӻ�notify����
		app_timer_rtc_1ms_start();  //1ms rtc��ʱ������
		app_timer_rtc_5ms_start();   //��������͸��
		*/
		
		uint32_t           err_code;
		err_code = app_timer_start( start_upload_count, APP_TIMER_TICKS( 1 ), NULL );
		APP_ERROR_CHECK( err_code );
	}
	else if (p_evt->type == BLE_NUS_EVT_TX_RDY)
	{
			 //NRF_LOG_INFO("BLE_NUS_EVT_TX_RDY");
			// ble_data_send_with_queue();
	}
}
/**@snippet [Handling the data received over BLE] */

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

