dzklwxz/nrf5SDK/examples/keep_david/David_keep_peripheral/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}

/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


//david add start 
void ble_data_send_with_queue(void)
{
	uint32_t err_code;
	uint8_t *p_buf = NULL;
	static bool retry = false;
	
	if (retry)
	{
		if(sendlength!=0)
		{
			err_code = ble_nus_data_send(&m_nus, send_data_pack, &sendlength, m_conn_handle);
			//NRF_LOG_INFO("Data2: %d", m_buf.p_data[0]);
			if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_RESOURCES) &&
					 (err_code != NRF_ERROR_NOT_FOUND) )
			{
					APP_ERROR_CHECK(err_code);
			}
			if (err_code == NRF_SUCCESS)
			{
				m_len_sent += sendlength;
				memset(send_data_pack,0x00,200); //reset send_data_pack
				sendlength=0;
				retry = false;
			}
		}
		else
		{
				retry = false;
		}
		
	}
	
	while (!nrf_queue_is_empty(&m_buf_queue) && !retry)
	{		
			uint8_t count = 0;
			uint8_t val = 0;
			
			//mtu 190 allow add 6 (each package length is 31byte) data package
		  //the queue has more than 6 data package
			if(nrf_queue_available_get(&m_buf_queue)<=14)
			{
				count = 0;
				val = 0;
				NRF_LOG_ERROR("full package");
				while(!nrf_queue_is_empty(&m_buf_queue))
				{
					val=count*31;
					err_code = nrf_queue_pop(&m_buf_queue, &p_buf);
					APP_ERROR_CHECK(err_code);
					memcpy(send_data_pack+val,p_buf,31);
					nrf_balloc_free(&m_balloc_AT_pool, p_buf);
					count++;
					if(count==6) //full 6 package
					{
						sendlength=0xBA; // 31*6
						break;
					}
				}
			}
			//the queue has less than 6 data package & the queue larger than one 
			//else if((nrf_queue_available_get(&m_buf_queue)>14)&&(nrf_queue_available_get(&m_buf_queue)<19))
			else 
			{
				count = 0;
				//left_val_count= nrf_queue_available_get(&m_buf_queue);
				//left_val_count=20-count; // get how many data in the queue 
				while(!nrf_queue_is_empty(&m_buf_queue))
				{
					val=count*31;
					err_code = nrf_queue_pop(&m_buf_queue, &p_buf);
					APP_ERROR_CHECK(err_code);
					memcpy(&send_data_pack[sendlength],p_buf,31);
					nrf_balloc_free(&m_balloc_AT_pool, p_buf);
					count++;
					sendlength+=31;
					
				}
			
			}
		 if(sendlength==0)
		 {
			  NRF_LOG_ERROR("wrong data");
				break;
		 }
		 /*
		 else if(sendlength>0x1F)
		 {
			NRF_LOG_INFO("LONG DATA");
		 }
		 */
			err_code = ble_nus_data_send(&m_nus, send_data_pack, &sendlength, m_conn_handle);
			//NRF_LOG_INFO("interrupt_send");
			if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_RESOURCES) &&
					 (err_code != NRF_ERROR_NOT_FOUND) )
			{
					APP_ERROR_CHECK(err_code);
			}
			if(err_code == NRF_SUCCESS)
			{
				memset(send_data_pack,0x00,200); //reset send_data_pack
				m_len_sent += sendlength;
				sendlength=0;
				retry = false;
			}
			else
			{
				retry = true;
				break;
			}
		
				
	}			
	
	
}

void create_data(void)
{
		if( rtc_5ms )
		{
			rtc_5ms = 0;
			ret_code_t err_code;
			uint16_t length = 0;
			uint8_t *pbuf = NULL;
			if(id>254)
			{
				id=0;
			}
			uint8_t *buf = nrf_balloc_alloc(&m_balloc_AT_pool);
			if(buf) //alloc succeed
			{
				buf[0] = 0xEE;  // head
				buf[1] = 0x33;  // head
				buf[2] = id++;  // sequency
				buf[3] = 0xAA;
				buf[4] = 0x1F;  // package length 31Byte
				//add local time 
				buf[5] = (uint8_t)(rtc_1ms >> 24);
				buf[6] = (uint8_t)(rtc_1ms >> 16);
				buf[7] = (uint8_t)(rtc_1ms >> 8);
				buf[8] = (uint8_t)(rtc_1ms >> 0);
				buf[9] = DEVICE_ID; // peripheral device id
				//add data 
				memset(&buf[10],0xAA,21);
				length=0x1F;
				//push the data into queue
				err_code = nrf_queue_push(&m_buf_queue, &buf);
				if( err_code == NRF_ERROR_NO_MEM )
				{
					NRF_LOG_INFO("Drop");
				}
				/*
				if(nrf_queue_available_get(&m_buf_queue)==19) // only add one node into queue
				{
					 err_code = nrf_queue_pop(&m_buf_queue, &pbuf);
			     APP_ERROR_CHECK(err_code);
						if(length==0)
			 {
				 NRF_LOG_ERROR("wrong data3");
			 }
					err_code = ble_nus_data_send(&m_nus, pbuf, &length, m_conn_handle);
					if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_RESOURCES) &&
							 (err_code != NRF_ERROR_NOT_FOUND) )
					{
							APP_ERROR_CHECK(err_code);
					}
					else
					{
						m_len_sent += length;
					}
					//free buf
					nrf_balloc_free(&m_balloc_AT_pool, pbuf);
				}
				*/
			}
			else 
			{
				NRF_LOG_ERROR("Buffer alloc fail ");
			}
			
			//calculate speed every 1 second
		m_cnt_5ms++;
		if( m_cnt_5ms == 200 )
		{
			NRF_LOG_INFO( "==**Speed: %d B/s**==", m_len_sent );
			printf( "==**Speed: %d B/s**==\r\n", m_len_sent );
			m_cnt_5ms = 0;
			m_len_sent = 0;
		}
			
		}
}



//ֹͣ�������ݣ����ջ���������
void clear_data(void)
{
	notify_req = 0;
	notify_enable = 0;
	
	id = 0;
	x = 0;
	y = 0;
	pos_x = 0;
	pos_y = 0;
	memset(send_data_pack,0x00,200); //reset send_data_pack
	sendlength=0;

	nrf_queue_reset( &m_buf_queue );
	nrf_balloc_init(&m_balloc_AT_pool);
	
	m_len_sent = 0;
	m_cnt_5ms = 0;
}

//Peter add end

/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;
    uint32_t           err_code;
    // Initialize.
    uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
	 //init memeory block & queue
    nrf_balloc_init(&m_balloc_AT_pool);
	  nrf_queue_reset(&m_buf_queue);
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    
		err_code = app_timer_create( &start_upload_count, APP_TIMER_MODE_REPEATED, start_upload_count_handler);
		APP_ERROR_CHECK( err_code );
	
    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();
    
	//user_fifo_init();  //���ڴ�ӡ������ʼ��
    // Enter main loop.
		//app_timer_rtc_5ms_start();
    for (;;)
    {
	   // make_data_task();  //�������ݣ�38byte/5ms
	  //  upload_data_task();  //�������ݣ�235byte/5ms  (5 + 38*6  + 2)  //��ͷ5�ֽ� + ����228�ֽ� + crc2�ֽ�
	    //user_fifo_task();  //��ӡfifo�е�log
			
      idle_state_handle();
      ble_data_send_with_queue();
    }
}

/**
 * @}
 */
